swenes/HID_Mouse_Project_PSoCsix/Staj_Mouse_HID_Project.cydsn/Generated_Source/PSoC6/CapSense_1_Control.c
    #if (CapSense_1_CSD_AUTOTUNE != CapSense_1_CSD_SS_DIS)
        if (CY_RET_SUCCESS == result)
        {
            result = CapSense_1_SsAutoTune();
        }
    #endif /* #if (CapSense_1_CSD_AUTOTUNE != CapSense_1_CSD_SS_DIS) */

    #if ((0u != CapSense_1_CSX_IDAC_AUTOCAL_EN) || \
        ((CapSense_1_CSD_AUTOTUNE == CapSense_1_CSD_SS_DIS) && (0u != CapSense_1_CSD_IDAC_AUTOCAL_EN)))
        if (CY_RET_SUCCESS == result)
        {
            result = CapSense_1_CalibrateAllWidgets();
        }
    #endif

    if (CY_RET_SUCCESS == result)
    {
        result = CapSense_1_ScanAllWidgets();
    }

    while(CapSense_1_NOT_BUSY != CapSense_1_IsBusy()){}

    CapSense_1_FtInitialize();
    CapSense_1_InitializeAllBaselines();

    #if(CapSense_1_ENABLE == CapSense_1_GES_GLOBAL_EN)
        if (CY_RET_SUCCESS == result)
        {
            CapSense_1_InitializeGestures();
        }
    #endif /* (CapSense_1_ENABLE == CapSense_1_GES_GLOBAL_EN) */

    #if (0u != CapSense_1_BALLISTIC_MULTIPLIER_EN)
        if (CY_RET_SUCCESS == result)
        {
            CapSense_1_InitializeBallisticMultiplier();
        }
    #endif /* (0u != CapSense_1_BALLISTIC_MULTIPLIER_EN) */

    #if (0u != CapSense_1_ADC_EN)
        CapSense_1_AdcInitialize();
    #endif /* (0u != CapSense_1_ADC_EN) */

    return result;
}

/*******************************************************************************
* Function Name: CapSense_1_Initialize
****************************************************************************//**
*
* \brief
*  This function initializes the CapSense_1 Component.
*
* \details
*  This API initializes all sub-modules of the CapSense_1 Component:
*   - Data Structure - set the default Component parameters defined in the Customizer.
*   - Data Processing - resets all widget statuses.
*   - Tuner - resets tuning state.
*   - Sensing - prepares CSD HW for operation.
*
*  Note that Data Structure module is initialized only once after the reset or
*  CapSense_1_Stop() API is called. The repeated calls of Initialize API
*  will not re-initialize Data Structure. This is done to preserve Component
*  parameters that user may set in runtime.
*
* \return
*  Return CY_RET_SUCCESS if the initialization was successful.
*
*******************************************************************************/
cy_status CapSense_1_Initialize(void)
{
    cy_status result;

    /* The Data Structure and Tuner are initialized only once */
    if (CapSense_1_INIT_NEEDED == CapSense_1_InitVar)
    {
        CapSense_1_DsInitialize();
        CapSense_1_TuInitialize();
        CapSense_1_InitVar = CapSense_1_INIT_DONE;
    }

    CapSense_1_DpInitialize();

    result = CapSense_1_SsInitialize();

    return result;
}

/*******************************************************************************
* Function Name: CapSense_1_Stop
****************************************************************************//**
*
* \brief
*  Stops the Component operation.
*
* \details
*  This function stops the Component operation, no sensor scanning can be
*  executed when the Component is stopped. Once stopped, the hardware block may
*  be reconfigured by the application program for any other special usage. The
*  Component operation can be resumed by calling the CapSense_1_Resume()
*  function or the Component can be reset by calling the
*  CapSense_1_Start() function.
*
*  This function is called when no scanning is in progress.
*  I.e. CapSense_1_IsBusy() returns a non-busy status.
*
* \return
*  Returns the status of the stop process. If CY_RET_SUCCESS is not received,
*  the stop process fails and retries may be required.
*
*******************************************************************************/
cy_status CapSense_1_Stop(void)
{
    cy_status result = CY_RET_SUCCESS;

    #if (CapSense_1_ENABLE == CapSense_1_ADC_EN)
        /* Release CSD resources */
        result = CapSense_1_SsReleaseResources();

        /* Release ADC resources */
        CapSense_1_AdcStop();
    #endif /* (CapSense_1_ENABLE == CapSense_1_ADC_EN) */

    CapSense_1_InitVar = CapSense_1_INIT_NEEDED;

    return result;
}

/*******************************************************************************
* Function Name: CapSense_1_Resume
****************************************************************************//**
*
* \brief
*  Resumes the Component operation if the CapSense_1_Stop() function was
*  called previously.
*
* \details
*  This function resumes the Component operation if the operation is stopped
*  previously by the CapSense_1_Stop() function. The following tasks are
*  executed as part of the operation resume process:
*    1. Reset all the Widgets/Sensors statuses.
*    2. Configure the hardware to perform capacitive sensing.
*
* \return
*  Returns the status of the resume process. If CY_RET_SUCCESS is not received,
*  the resume process fails and retries may be required.
*
*******************************************************************************/
cy_status CapSense_1_Resume(void)
{
    cy_status result;

    /* The Tuner are initialized only once in order not to break communication */
    if (CapSense_1_INIT_NEEDED == CapSense_1_InitVar)
    {
        CapSense_1_TuInitialize();
        CapSense_1_InitVar = CapSense_1_INIT_DONE;
    }
    CapSense_1_DpInitialize();

    result = CapSense_1_SsInitialize();

    return result;
}

/*******************************************************************************
* Function Name: CapSense_1_ProcessAllWidgets
****************************************************************************//**
*
* \brief
*  Performs full data processing of all enabled widgets.
*
* \details
*  This function performs all data processes for all enabled widgets in the
*  Component. The following tasks are executed as part of processing all the
*  widgets:
*    1. Apply raw count filters to the raw counts, if they are enabled in the
*       customizer.
*    2. Update the thresholds if the SmartSense Full Auto-Tuning is enabled in
*       the customizer.
*    3. Update the baselines and difference counts for all the sensors.
*    4. Update the sensor and widget status (on/off), update the centroid for
*       the sliders and the X/Y position for the touchpads.
*
*  This function is called by an application program only after all the enabled
*  widgets (and sensors) in the Component is scanned. Calling this function
*  multiple times without sensor scanning causes unexpected behavior.
*
*  The disabled widgets are not processed by this function. To disable/enable
*  a widget, set the appropriate values in the
*  CapSense_1_WDGT_ENABLE<RegisterNumber>_PARAM_ID register using the
*  CapSense_1_SetParam() function.
*
*  If the Ballistic multiplier filter is enabled the Timestamp must be
*  updated before calling this function using the
*  CapSense_1_IncrementGestureTimestamp() function.
*
*  If the Self-test library is enabled, this function executes the baseline duplication
*  test. Refer to CapSense_1_CheckBaselineDuplication() for details.
*
* \return
*  Returns the status of the processing operation. If CY_RET_SUCCESS is not received,
*  the processing fails and retries may be required.
*
*******************************************************************************/
cy_status CapSense_1_ProcessAllWidgets(void)
{
    uint32 wdgtId;
    cy_status result = CY_RET_SUCCESS;
    CapSense_1_FLASH_WD_STRUCT const *ptrFlashWdgt;

