swenes/HID_Mouse_Project_PSoCsix/Staj_Mouse_HID_Project.cydsn/Generated_Source/PSoC6/CapSense_1_Control.c
    ptrFlashWdgt = CapSense_1_dsFlash.wdgtArray;

    for (wdgtId = 0u; wdgtId < CapSense_1_TOTAL_WIDGETS; wdgtId++)
    {
        if (0uL != CapSense_1_GET_WIDGET_EN_STATUS(wdgtId))
        {
            switch(CapSense_1_GET_SENSE_METHOD(ptrFlashWdgt))
            {
            #if (0u != CapSense_1_TOTAL_CSD_WIDGETS)
                case CapSense_1_SENSE_METHOD_CSD_E:
                    result = CapSense_1_DpProcessCsdWidgetRawCounts(ptrFlashWdgt);
                    CapSense_1_DpProcessCsdWidgetStatus(wdgtId, ptrFlashWdgt);
                    break;
            #endif /* #if (0u != CapSense_1_TOTAL_CSD_WIDGETS) */

            #if (0u != CapSense_1_TOTAL_CSX_WIDGETS)
                case CapSense_1_SENSE_METHOD_CSX_E:
                    result = CapSense_1_DpProcessCsxWidgetRawCounts(ptrFlashWdgt);
                    CapSense_1_DpProcessCsxWidgetStatus(wdgtId, ptrFlashWdgt);
                    break;
            #endif /* #if (0u != CapSense_1_TOTAL_CSX_WIDGETS) */

            default:
                CY_ASSERT(0 != 0);
                break;
            }

            #if (CapSense_1_ENABLE == CapSense_1_TST_BSLN_DUPLICATION_EN)
                if (CY_RET_SUCCESS != result)
                {
                    CapSense_1_UpdateTestResultBaselineDuplication(wdgtId, result);
                    result = CY_RET_BAD_DATA;
                }
            #endif /* (CapSense_1_ENABLE == CapSense_1_TST_BSLN_DUPLICATION_EN) */

        }
        ptrFlashWdgt++;
    }
    return result;
}

/*******************************************************************************
* Function Name: CapSense_1_ProcessWidget
****************************************************************************//**
*
* \brief
*  Performs full data processing of the specified widget if it is enabled.
*
* \details
*  This function performs exactly the same tasks as
*  CapSense_1_ProcessAllWidgets(), but only for a specified widget. This
*  function can be used along with the CapSense_1_SetupWidget() and
*  CapSense_1_Scan() functions to scan and process data for a specific
*  widget. This function is called only after all the sensors in the
*  widgets are scanned. A disabled widget is not processed by this function.
*
*  A pipeline scan method (i.e. during scanning of a widget perform processing
*  of the previously scanned widget) can be implemented using this function and
*  it may reduce the total execution time, increase the refresh rate and
*  decrease the average power consumption.
*
*  If the Ballistic multiplier filter is enabled the Timestamp must be
*  updated before calling this function using the
*  CapSense_1_IncrementGestureTimestamp() function.
*
*  If the Self-test library is enabled, this function executes the baseline duplication
*  test. Refer to CapSense_1_CheckBaselineDuplication() for details.
*
* \param widgetId
*  Specifies the ID number of the widget to be processed.
*  A macro for the widget ID can be found in the
*  CapSense_1 Configuration header file defined as
*  CapSense_1_<WidgetName>_WDGT_ID
*
* \return
*  Returns the status of the widget processing:
*  - CY_RET_SUCCESS - The operation is successfully completed
*  - CY_RET_BAD_PARAM - The input parameter is invalid
*  - CY_RET_INVALID_STATE - The specified widget is disabled
*  - CY_RET_BAD_DATA - The processing is failed
*
*******************************************************************************/
cy_status CapSense_1_ProcessWidget(uint32 widgetId)
{
    cy_status result = CY_RET_SUCCESS;
    CapSense_1_FLASH_WD_STRUCT const *ptrFlashWdgt;

    if (widgetId >= CapSense_1_TOTAL_WIDGETS)
    {
        result = CY_RET_BAD_PARAM;
    }

    if ((CY_RET_SUCCESS == result) && (0uL == CapSense_1_GET_WIDGET_EN_STATUS(widgetId)))
    {
        result = CY_RET_INVALID_STATE;
    }

    if (CY_RET_SUCCESS == result)
    {
        ptrFlashWdgt = &CapSense_1_dsFlash.wdgtArray[widgetId];

        switch(CapSense_1_GET_SENSE_METHOD(ptrFlashWdgt))
        {
        #if (0u != CapSense_1_TOTAL_CSD_WIDGETS)
            case CapSense_1_SENSE_METHOD_CSD_E:
                result = CapSense_1_DpProcessCsdWidgetRawCounts(ptrFlashWdgt);
                CapSense_1_DpProcessCsdWidgetStatus(widgetId, ptrFlashWdgt);
                break;
        #endif /* #if (0u != CapSense_1_TOTAL_CSD_WIDGETS) */

        #if (0u != CapSense_1_TOTAL_CSX_WIDGETS)
            case CapSense_1_SENSE_METHOD_CSX_E:
                result = CapSense_1_DpProcessCsxWidgetRawCounts(ptrFlashWdgt);
                CapSense_1_DpProcessCsxWidgetStatus(widgetId, ptrFlashWdgt);
                break;
        #endif /* #if (0u != CapSense_1_TOTAL_CSX_WIDGETS) */

        default:
            CY_ASSERT(0 != 0);
            break;
        }

        #if (CapSense_1_ENABLE == CapSense_1_TST_BSLN_DUPLICATION_EN)
            if (CY_RET_SUCCESS != result)
            {
                CapSense_1_UpdateTestResultBaselineDuplication(widgetId, result);
                result = CY_RET_BAD_DATA;
            }
        #endif /* (CapSense_1_ENABLE == CapSense_1_TST_BSLN_DUPLICATION_EN) */
    }
    return result;
}


/*******************************************************************************
* Function Name: CapSense_1_ProcessWidgetExt
****************************************************************************//**
*
* \brief
*  Performs customized data processing on the selected widget.
*
* \details
*  This function performs data processes for the specified widget specified by
*  the mode parameter. The execution order of the requested operations is from
*  LSB to MSB of the mode parameter. For a different order, this API
*  can be called multiple times with the required mode parameter.
*
*  This function can be used with any of the available scan functions. This
*  function is called only after all the sensors in the specified widget are
*  scanned. Calling this function multiple times with the same mode without
*  sensor scanning causes unexpected behavior. This function ignores the value
*  of the wdgtEnable register.
*
*  The CapSense_1_PROCESS_CALC_NOISE and
*  CapSense_1_PROCESS_THRESHOLDS flags are supported by the CSD sensing
*  method only when Auto-tuning mode is enabled.
*
*  The pipeline scan method (i.e. during scanning of a widget, processing
*  of a previously scanned widget is performed) can be implemented using this
*  function and it may reduce the total scan/process time, increase the refresh
*  rate and decrease the power consumption.
*
*  If the Self-test library is enabled, this function executes the baseline duplication
*  test. Refer to CapSense_1_CheckBaselineDuplication() for details.
*
*  If the Ballistic multiplier filter is enabled the Timestamp must be
*  updated before calling this function using the
*  CapSense_1_IncrementGestureTimestamp() function.
*
* \param widgetId
*  Specifies the ID number of the widget to be processed.
*  A macro for the widget ID can be found in the CapSense_1 Configuration header
*  file defined as CapSense_1_<WidgetName>_WDGT_ID.

* \param mode
*  Specifies the type of widget processing to be executed for the
*  specified widget:
*    1. Bits [31..6] - Reserved.
*    2. Bits [5..0] - CapSense_1_PROCESS_ALL - Execute all the tasks.
*    3. Bit [5] - CapSense_1_PROCESS_STATUS - Update the status (on/off,
*       centroid position).
*    4. Bit [4] - CapSense_1_PROCESS_THRESHOLDS - Update the thresholds
*       (only in CSD auto-tuning mode).
*    5. Bit [3] - CapSense_1_PROCESS_CALC_NOISE - Calculate the noise (only in
*       CSD auto-tuning mode).
*    6. Bit [2] - CapSense_1_PROCESS_DIFFCOUNTS - Update the difference counts.
*    7. Bit [1] - CapSense_1_PROCESS_BASELINE - Update the baselines.
*    8. Bit [0] - CapSense_1_PROCESS_FILTER - Run the firmware filters.
*
* \return
*  Returns the status of the widget processing operation:
*  - CY_RET_SUCCESS - The processing is successfully performed.
*  - CY_RET_BAD_PARAM - The input parameter is invalid.
*  - CY_RET_BAD_DATA - The processing failed.
*
*******************************************************************************/
cy_status CapSense_1_ProcessWidgetExt(uint32 widgetId, uint32 mode)
{
    uint32 snsCount;
    cy_status result = CY_RET_BAD_PARAM;
    CapSense_1_FLASH_WD_STRUCT const *ptrFlashWdgt;
    CapSense_1_PTR_FILTER_VARIANT fltrHistV;
    CapSense_1_RAM_SNS_STRUCT *ptrSnsTmp;

    #if (0u != CapSense_1_TOTAL_CSD_WIDGETS)
        uint32 isProxWdgt;
    #endif

    if (widgetId < CapSense_1_TOTAL_WIDGETS)
    {
        ptrFlashWdgt = &CapSense_1_dsFlash.wdgtArray[widgetId];
        snsCount = CapSense_1_GET_SNS_CNT_BY_PTR(ptrFlashWdgt);
        ptrSnsTmp = ptrFlashWdgt->ptr2SnsRam;
        fltrHistV.ptr = ptrFlashWdgt->ptr2FltrHistory;

