swenes/HID_Mouse_Project_PSoCsix/Staj_Mouse_HID_Project.cydsn/Generated_Source/PSoC6/CapSense_1_Control.c
        switch(CapSense_1_GET_SENSE_METHOD(ptrFlashWdgt))
        {
        #if (0u != CapSense_1_TOTAL_CSD_WIDGETS)
            case CapSense_1_SENSE_METHOD_CSD_E:
                if (CapSense_1_WD_PROXIMITY_E == (CapSense_1_WD_TYPE_ENUM)ptrFlashWdgt->wdgtType)
                {
                    #if (0u != CapSense_1_PROX_RC_ALP_FILTER_EN)
                        fltrHistV.ptr = &fltrHistV.ptrAlp[sensorId];
                    #elif (0u != CapSense_1_PROX_RC_FILTER_EN)
                        fltrHistV.ptr = &fltrHistV.ptrProx[sensorId];
                    #endif
                }
                else
                {
                    #if (0u != CapSense_1_REGULAR_RC_ALP_FILTER_EN)
                        fltrHistV.ptr = &fltrHistV.ptrAlp[sensorId];
                    #elif (0u != CapSense_1_REGULAR_RC_FILTER_EN)
                        fltrHistV.ptr = &fltrHistV.ptrRegular[sensorId];
                    #endif
                }

                result = CapSense_1_DpProcessCsdSensorRawCountsExt(ptrFlashWdgt, ptrSnsTmp, fltrHistV, mode);
                break;
        #endif /* #if (0u != CapSense_1_TOTAL_CSD_WIDGETS) */

        #if (0u != CapSense_1_TOTAL_CSX_WIDGETS)
            case CapSense_1_SENSE_METHOD_CSX_E:
                #if (0u != CapSense_1_REGULAR_RC_ALP_FILTER_EN)
                    fltrHistV.ptr = &fltrHistV.ptrAlp[sensorId];
                #elif (0u != CapSense_1_REGULAR_RC_FILTER_EN)
                    fltrHistV.ptr = &fltrHistV.ptrRegular[sensorId];
                #endif

                result = CapSense_1_DpProcessCsxSensorRawCountsExt(ptrFlashWdgt, ptrSnsTmp, fltrHistV, mode);
                break;
        #endif /* #if (0u != CapSense_1_TOTAL_CSX_WIDGETS) */

        default:
            CY_ASSERT(0 != 0);
            break;
        }

        #if (CapSense_1_ENABLE == CapSense_1_TST_BSLN_DUPLICATION_EN)
            if (CY_RET_SUCCESS != result)
            {
                CapSense_1_UpdateTestResultBaselineDuplication(widgetId, sensorId);
                result = CY_RET_BAD_DATA;
            }
        #endif /* (CapSense_1_ENABLE == CapSense_1_TST_BSLN_DUPLICATION_EN) */

    }
    return result;
}

/*******************************************************************************
* Function Name: CapSense_1_Sleep
****************************************************************************//**
*
* \brief
*  Prepares the Component for deep sleep.
*
* \details
*  Currently this function is empty and exists as a place for future updates,
*  this function will be used to prepare the Component to enter deep sleep.
*
*******************************************************************************/
void CapSense_1_Sleep(void)
{
}


/*******************************************************************************
* Function Name: CapSense_1_Wakeup
****************************************************************************//**
*
* \brief
*  Resumes the Component after sleep.
*
* \details
*  Resumes the Component after sleep. This function shall be used to resume
*  the Component after exiting deep sleep.
*
*******************************************************************************/
void CapSense_1_Wakeup(void)
{
    #if(CapSense_1_BLOCK_ANALOG_WAKEUP_DELAY_US > 0uL)
        Cy_SysLib_DelayUs(CapSense_1_BLOCK_ANALOG_WAKEUP_DELAY_US);
    #endif /* (CapSense_1_BLOCK_ANALOG_WAKEUP_DELAY_US > 0uL) */
}


#if (CY_SYSPM_DRV_VERSION_MAJOR < 4u)
    /*******************************************************************************
    * Function Name: CapSense_1_DeepSleepCallback
    ****************************************************************************//**
    *
    * \brief
    *  Handles Active to DeepSleep power mode transition for the CapSense_1
    *  Component. This function is used when the major version of the SysPm driver
    *  is less than 4.
    *
    * \details
    *  This function handles Active to DeepSleep power mode transition
    *  for the CapSense_1 Component.
    *  Calling this function directly by application layer is not recommended.
    *  Instead, Cy_SysPm_DeepSleep() should be used for the Active to DeepSleep
    *  power mode transition of the device.
    *
    *  For proper operation of the CapSense_1 Component during the Active to
    *  DeepSleep mode transition, a callback to this API should be registered
    *  using the Cy_SysPm_RegisterCallback() function with CY_SYSPM_DEEPSLEEP
    *  type. Once the callback is registered, this function is called by the
    *  Cy_SysPm_DeepSleep() function to prepare the Component to the device
    *  power mode transition.
    *
    *  When this function is called with CY_SYSPM_CHECK_READY as input, this
    *  function returns CY_SYSPM_SUCCESS if no scanning is in progress, otherwise
    *  CY_SYSPM_FAIL is returned. If CY_SYSPM_FAIL status is returned, a device
    *  cannot change the power mode without completing the current scan as
    *  a transition to DeepSleep during the scan can disrupt the Component
    *  operation.
    *
    * \param callbackParams
    *  Refer to the description of the cy_stc_syspm_callback_params_t type in the
    *  Peripheral Driver Library documentation.
    *
    * \return
    *  Returns the status of the operation requested by the mode parameter:
    *  - CY_SYSPM_SUCCESS  - DeepSleep power mode can be entered.
    *  - CY_SYSPM_FAIL     - DeepSleep power mode cannot be entered.
    *
    *******************************************************************************/
    cy_en_syspm_status_t CapSense_1_DeepSleepCallback(cy_stc_syspm_callback_params_t *callbackParams)
    {
        return(CapSense_1_SwitchPowerModeCallback(callbackParams));
    }


    /*******************************************************************************
    * Function Name: CapSense_1_EnterLowPowerCallback
    ****************************************************************************//**
    *
    * \brief
    *  Handles Active to Low Power Active (LPActive) power mode transition for
    *  the CapSense_1 Component. This function is used when the major version
    *  of the SysPm driver is less than 4.
    *
    * \details
    *  This function handles the Active to LPActive power mode transition for
    *  the CapSense_1 Component.
    *  Calling this function directly by application layer is not recommended.
    *  Instead, Cy_SysPm_EnterLpMode() should be used for the Active to LPActive
    *  power mode transition of the device.
    *
    *  For proper operation of the CapSense_1 Component during the Active to
    *  LPActive mode transition, a callback to this function should be registered
    *  using the Cy_SysPm_RegisterCallback() function with CY_SYSPM_ENTER_LP_MODE
    *  type. Once the callback is registered, this function is called by the
    *  Cy_SysPm_EnterLpMode() function to prepare the Component to the device
    *  power mode transition.
    *
    *  When this function is called with CY_SYSPM_CHECK_READY as input, this
    *  function returns CY_SYSPM_SUCCESS if no scanning is in progress, otherwise
    *  CY_SYSPM_FAIL is returned. If CY_SYSPM_FAIL status is returned, a device
    *  cannot change the power mode without completing the current scan as
    *  a transition to LPActive during the scan can disrupt the Component
    *  operation.
    *
    * \param callbackParams
    *  Refer to the description of the cy_stc_syspm_callback_params_t type in the
    *  Peripheral Driver Library documentation.
    *
    * \return
    *  Returns the status of the operation requested by the mode parameter:
    *  - CY_SYSPM_SUCCESS  - LPActive power mode can be entered.
    *  - CY_SYSPM_FAIL     - LPActive power mode cannot be entered.
    *
    *******************************************************************************/
    cy_en_syspm_status_t CapSense_1_EnterLowPowerCallback(cy_stc_syspm_callback_params_t *callbackParams)
    {
        return(CapSense_1_SwitchPowerModeCallback(callbackParams));
    }


